In [74]:
path_to_zip_file = "datasets.zip"
direcyory_to_extract_to = ""

import zipfile
zip_ref = zipfile.ZipFile(path_to_zip_file,'r')
zip_ref.extractall(direcyory_to_extract_to)
zip_ref.close()
print('Done!')

Done!

In [75]:
import pandas as pd
Location = "datasets/smallgradesh.csv"
df = pd.read_csv(Location, header=None)
print('Done!')

Done!

In [76]:
df.head()

         0      1
0     Name  Grade
1   Marcia   82.4
2   Kadeem   78.2
3     Nash   79.3
4  Noelani   83.2

In [77]:
import pandas as pd
Location = "datasets/smallgradesh.csv"
df = pd.read_csv(Location, names= ['Names','Grades'])

In [37]:
df.columns = ['Names','Grades2']

In [78]:
df.head()

     Names Grades
0     Name  Grade
1   Marcia   82.4
2   Kadeem   78.2
3     Nash   79.3
4  Noelani   83.2

In [79]:
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
print('Done!')

Done!

In [80]:
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [81]:
import pandas as pd
Location = "datasets/statecalifornia.csv"
df = pd.read_csv(Location)
print('Done!')

Done!

In [82]:
df.head()

,GEOID,SUMLEV,STATE,COUNTY,CBSA,CSA,NECTA,CNECTA,NAME,POP100,HU100,POP100.2000,HU100.2000,P001001,P001001.2000
0,6,40,6,NaN,NaN,NaN,NaN,NaN,California,37253956,13680081,33871648,12214549,37253956,33871648

In [83]:
import pandas as pd
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]

listNames = [['Bob',76],['Jessica',95],['Mary',77],['John',78],['Mel',99]]

df = pd.DataFrame(data = listNames, columns =['Names','Grades'])

df.to_csv('studentgrades.csv',index=False,header=False)
print('Done!')

Done!

In [84]:
df.head()

     Names  Grades
0      Bob      76
1  Jessica      95
2     Mary      77
3     John      78
4      Mel      99

In [85]:
import pandas as pd
Location = "datasets/gradedata.xlsx"
df = pd.read_excel(Location)

In [86]:
df.columns = ['first','last','sex','age','exer','hrs','grd','addr']

In [87]:
df.head()

,first,last,sex,age,exer,hrs,grd,addr
0,Marcia,Pugh,female,17,3,10,82.4,"7379 Highland Rd. , Dublin, GA 31021"
1,Kadeem,Morrison,male,18,4,4,78.2,"8 Bayport St. , Honolulu, HI 96815"
2,Nash,Powell,male,18,5,9,79.3,"Encino, CA 91316, 3 Lilac Street"
3,Noelani,Wagner,female,14,2,7,83.2,"Riverview, FL 33569, 9998 North Smith Dr."
4,Noelani,Cherry,female,18,4,15,87.4,"97 SE. Ocean Street , Bethlehem, PA 18015"

In [90]:
import pandas as pd
listData = [['Bob',76],['Jessica',95],['Mary',77],['John',78],['Mel',99]]
columnsName = ['Names','Grades']
df = pd.DataFrame(data = listData, columns = columnsName)
writer = pd.ExcelWriter('dataframe.xlsx',engine="xlsxwriter")
df.to_excel(writer,sheet_name="Sheet1")
writer.save()
print('Done!')

Done!

In [89]:
df.head()

     Names  Grades
0      Bob      76
1  Jessica      95
2     Mary      77
3     John      78
4      Mel      99

In [91]:
import pandas as pd

columnsName = ['Names','Grades']

listData = [['Bob',76],['Jessica',95],['Mary',77],['John',78],['Mel',99]]
df = pd.DataFrame(data = listData, columns = columnsName)

listData = [['Eze',76],['Luu',95],['Mike',77],['Jim',78],['Lin',99]]
df2 = pd.DataFrame(data = listData, columns = columnsName)

writer = pd.ExcelWriter('dataframe.xlsx',engine="xlsxwriter")
df.to_excel(writer,sheet_name="Sheet1")
writer.save()
print('Done!')